#include <iostream>
int main(){
    // // 1.	Для введённого пользователем целого числа выдать максимальную цифру, минимальную цифру и их произведение
    


    // int mult {1};
    // int min {1};
    // int max {1};
    // int n {1};

    // std::cout<<"Вводите целые числа. По окончании введите 0";
    // for (; n != 0; ){
    //     std::cin>>n;
    //     if (n>max){
    //         max = n;
    //     }
    //     if (min == 1) {
    //         min = max

    //     }
    //     if n<min{
    //         min = n;
    //     }
    //     mult *= n;

    // }

    // std::cout<<"Минимальное значение:\n"<<min<<"\n"<<"Максимальное значение\n"<<max<"\n"<<"Произведение\n"<<mult<<"\n";

    // mult = 1;
    // min = 1;
    // max = 1;
    // n = 1;
    // std::cout<<"Вводите целые числа. По окончании введите 0";
    // while(n != 0){
    //     std::cin>>n;
    //     if (n>max){
    //         max = n;
    //     }
    //     if (min == 1) {
    //         min = max

    //     }
    //     if n<min{
    //         min = n;
    //     }
    //     mult *= n;
    // }
    // std::cout<<"Минимальное значение:\n"<<min<<"\n"<<"Максимальное значение\n"<<max<"\n"<<"Произведение\n"<<mult<<"\n";

    // mult = 1;
    // min = 1;
    // max = 1;
    // n = 1;
    // std::cout<<"Вводите целые числа. По окончании введите 0";
    // do{
    //     std::cin>>n;
    //     if (n>max){
    //         max = n;
    //     }
    //     if (min == 1) {
    //         min = max

    //     }
    //     if n<min{
    //         min = n;
    //     }
    //     mult *= n;
    // }while(n != 0);





    //2.	Последовательность содержит некоторое количество натуральных чисел и заканчивается числом 0 
    //(0 не является элементом последовательности). Найти сумму вех элементов последовательности
    /*

    int sum;
    int n = 1;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    while(n!=0){
        std::cin>>n;
        sum += n;

    }
    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";


    sum = 0;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    for (int n {1}; n!=0;){
        std::cin>>n;
        sum += n;
    }
    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";

    sum = 0;
    n = 1;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    do{
        std::cin>>n;
        sum += n;

    }while(n!=0);

    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";
    */



    // 4.	Для каждого натурального числа в промежутке от N до M вывести все делители, 
    // кроме единицы и самого числа. Значения N и M вводятся с клавиатуры.

//     int N;
//     int M;
    

//     std::cout<<"Введите начало и конец числового промежутка\n";
//     std::cin>>N>>M;
    

//     for(n {N};n<M;n++){
//         std::cout<<"Делители числа "<<n<<"\n";
//         for(dev {N}; dev<M; dev++){
            
//             if(n%dev == 0){
//                std::cout<<dev<<"\n";
//             }
//         }

//     }

//     int dev;
//     int n {N};


//     while(n < M){
//         std::cout<<"Делители числа "<<n<<"\n";
//         while(dev < M){
//             if(n%dev == 0){
//                std::cout<<dev<<"\n";
//             }
//         }
//     }
//     int dev;
//     int n {N};
//     do{
//         std::cout<<"Делители числа "<<n<<"\n";
//         do{
//             if(n%dev == 0){
//                std::cout<<dev<<"\n";
//             }
//         }while(dev < M);
//     }while(n < M);





// 5.	Вывести на экран двумерную таблицу умножения.


    int b = 1;
    for(int a = 1; a != 11; a++){
        if (b == 11){b = 1;}
        for(b = 1; b != 11; b++){
            std::cout<<a<<"*"<<b<<"="<<a*b<<"\n";
            
        }
    }

    int a = 1;
    int b = 1;

    while(a != 11){
        if (b == 11){
            b = 1;
            a ++;
        }
        while(b != 10){
            std::cout<<a<<"*"<<b<<"="<<a*b<<"\n";
        }

    }

    int a = 1;
    int b = 1;

    do{
        if (b == 11){
            b = 1;
            a ++;
        }
        do{
            std::cout<<a<<"*"<<b<<"="<<a*b<<"\n";
        }while(b != 10);
    }while (a != 10);

    return 0;}
