#include <iostream>
int main(){
    // // 1.	Для введённого пользователем целого числа выдать максимальную цифру, минимальную цифру и их произведение
    // int digit;
    // std::cout<<"Введите целое число\n";
    // for(int digit = digit; );



    //2.	Последовательность содержит некоторое количество натуральных чисел и заканчивается числом 0 
    //(0 не является элементом последовательности). Найти сумму вех элементов последовательности
    /*

    int sum;
    int n = 1;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    while(n!=0){
        std::cin>>n;
        sum += n;

    }
    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";


    sum = 0;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    for (int n {1}; n!=0;){
        std::cin>>n;
        sum += n;
    }
    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";

    sum = 0;
    n = 1;
    std::cout<<"Вводите натуральные числа. По окончании введите 0\n";
    do{
        std::cin>>n;
        sum += n;

    }while(n!=0);

    std::cout<<"Сумма последовательности натуральных чисел\n"<<sum<<"\n";
    */


    return 0;
}