Sample C++ code
#include <iostream>
#include <cmath>
using namespace std;
//1. Пользователь вводит сторону квадрата. Найти периметр и площадь квадрата.
int main() {
    int a,s,p;
    cin>>a;
    p=a*4;
    s=a*a;
    cout<<p<<endl<<s;
    return 0;
}

// 2.Пользователь вводит время в минутах и расстояние в километрах. Найдите скорость в м/c.
int main() {
    double t,s,v;
    cin>>t>>s;
    v=s/t;
    v=(v*1000)/3600;
    cout<<v;
    return 0;
}
// 3.Даны катеты прямоугольного треугольника. Найдите площадь, периметр и гипотенузу треугольника.
int main() {
    double a,b,s,p,g;
    cin>>a>>b;
    s=(a*b)/2;
    g=sqrt(a*a+b*b);
    p=a+b+g;
    cout<<s<<endl<<p<<endl<<g;
    return 0;
}
// 4.Дано значение температуры в градусах Цельсия. Вывести температуру в градусах Фаренгейта.
int main() {
    double f,c;
    cin>>f;
    // Т (°C) = (Т (°F) - 32) × 5/9.
    c=(f-32)*5/9;
    cout<<c;
    return 0;
}
// 5.Известно, что x кг конфет стоит a рублей. Определите, сколько стоит y кг этих конфет, а также сколько кг конфет можно купить на k рублей. Все значения вводит пользователь.
int main() {
    double x,a,y,k,c,c1;
    cin>>x>>a>>y>>k;
    // Т (°C) = (Т (°F) - 32) × 5/9.
    c=x/a*y;
    c1=k/(x/a);
    cout<<c<<endl<<c1;
    return 0;
}
// 6.Пользователь вводит количество недель, месяцев, лет и получает количество дней за это время. Считать, что в месяце 30 дней.
int main() {
    double n,m,l,d;
    cin>>n>>m>>l;
    n=n*7;
    m=m*30;
    l=l*360;
    d=n+m+l;
    cout<<d;
    return 0;
}

    